import React from 'react';
import Link from "next/link";

const PageCard = () => {
    const cardsData = [
        {
            id: 1,
            icon: <svg
                xmlns="http://www.w3.org/2000/svg"
                width="36"
                height="36"
                viewBox="0 0 35 32"
                fill="none"
            >
                <path
                    d="M1.06469 11.1572C-0.354921 10.4679 -0.354871 8.39371 1.06469 7.70439L16.4159 0.249937C17.1022 -0.0833125 17.8978 -0.0833122 18.5841 0.249937L33.9353 7.70439C35.1754 8.30654 35.3322 9.96533 34.4059 10.8348V18.1113C34.4059 19.0701 33.649 19.8474 32.7153 19.8474C31.7816 19.8474 31.0247 19.0701 31.0247 18.1113V12.5706L18.5841 18.6117C17.8978 18.9449 17.1022 18.9449 16.4159 18.6117L1.06469 11.1572Z"
                    fill="#E7BA45"
                />
                <path
                    d="M5.66566 19.8474V16.8639L16.4159 22.0841C17.1022 22.4174 17.8978 22.4174 18.5841 22.0841L29.3341 16.864V19.8474C29.3341 26.5591 24.0357 32 17.4999 32C10.964 32 5.66566 26.5591 5.66566 19.8474Z"
                    fill="#E7BA45"
                />
            </svg>,
            title: "دانشگاهی",
            description:
                "این مجموعه طرف قرارداد با نمایندگی های بین الملل دانشگاه پیام نور می باشد",
            Link: "/services/دوره-دانشگاهی",
        },
        {
            id: 2,
            icon: <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fillRule="evenodd" clipRule="evenodd"
                      d="M6.83398 8.54199C6.83398 5.71153 9.12853 3.41699 11.959 3.41699H30.7507C32.6376 3.41699 34.1673 4.94669 34.1673 6.83366V29.0249C34.1673 29.3112 34.1029 29.5742 33.9746 29.8307L33.0426 31.6947C32.8022 32.1756 32.8022 32.7417 33.0426 33.2227L33.9716 35.0806C34.0966 35.318 34.1673 35.5884 34.1673 35.8753C34.1673 36.8188 33.4025 37.5837 32.459 37.5837H11.959C9.12852 37.5837 6.83398 35.2891 6.83398 32.4587V8.54199ZM11.959 30.7503H29.7387C29.3479 31.8553 29.3479 33.062 29.7387 34.167H11.959C11.0155 34.167 10.2507 33.4021 10.2507 32.4587C10.2507 31.5152 11.0155 30.7503 11.959 30.7503ZM17.084 11.9587C16.1405 11.9587 15.3757 12.7235 15.3757 13.667C15.3757 14.6105 16.1405 15.3753 17.084 15.3753H23.9173C24.8608 15.3753 25.6257 14.6105 25.6257 13.667C25.6257 12.7235 24.8608 11.9587 23.9173 11.9587H17.084Z"
                      fill="#E7BA45"/>
            </svg>,
            title: "BA",
            description:
                "دوره های MBA، DBA و Post DBA دانشگاهی به عنوان معتبرترین دوره های بین المللی کسب و کار",
            Link: "/services/دوره-آموزشی-BA",
        },
        {
            id: 3,
            icon: <svg width="29" height="30" viewBox="0 0 29 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M21.5735 0.767246C21.9956 0.0328432 22.9293 -0.218116 23.659 0.206713C25.5688 1.31864 27.2598 2.76715 28.6525 4.47151C29.1879 5.12678 29.0942 6.09487 28.4432 6.6338C27.7921 7.17272 26.8303 7.0784 26.2948 6.42313C25.1327 5.001 23.722 3.79288 22.1304 2.86622C21.4008 2.44139 21.1514 1.50165 21.5735 0.767246Z"
                    fill="#E7BA45"/>
                <path
                    d="M7.42647 0.767246C7.84856 1.50165 7.59922 2.44139 6.86955 2.86622C5.27796 3.79288 3.86727 5.001 2.70519 6.42313C2.16974 7.0784 1.20789 7.17272 0.556833 6.6338C-0.0942197 6.09487 -0.187933 5.12678 0.347519 4.47151C1.74022 2.76715 3.43123 1.31864 5.34102 0.206714C6.07069 -0.218115 7.00438 0.0328436 7.42647 0.767246Z"
                    fill="#E7BA45"/>
                <path fillRule="evenodd" clipRule="evenodd"
                      d="M0.763156 16.1741C0.763156 8.53826 6.91333 2.3482 14.5 2.3482C22.0866 2.3482 28.2368 8.53826 28.2368 16.1741C28.2368 23.8099 22.0866 30 14.5 30C6.91333 30 0.763156 23.8099 0.763156 16.1741ZM12.9738 10.0293C12.9738 9.18083 13.6571 8.49304 14.5001 8.49304C15.3431 8.49304 16.0264 9.18083 16.0264 10.0293V15.5379L18.7928 18.3222C19.3888 18.9222 19.3888 19.8948 18.7928 20.4948C18.1967 21.0947 17.2303 21.0947 16.6342 20.4948L13.4207 17.2604C13.1173 16.9551 12.9684 16.5532 12.9738 16.1531V10.0293Z"
                      fill="#E7BA45"/>
            </svg>,
            title: "کوتاه مدت",
            description:
                "دوره های کوتاه مدت در چند صد عنوان مختلف جهت افزایش مهارت و توانمندی های تخصصی افراد",
            Link: "/services/دوره-های-کوتاه-مدت",
        },
        {
            id: 4,
            icon: <svg width="32" height="36" viewBox="0 0 32 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fillRule="evenodd" clipRule="evenodd"
                      d="M26.2347 0.443083C25.5229 -0.197229 24.4294 -0.136347 23.7922 0.579066C23.1551 1.29448 23.2157 2.39351 23.9275 3.03382C26.7613 5.58287 28.5406 9.28167 28.5406 13.4004C28.5406 21.0749 22.3556 27.2974 14.7221 27.3079L14.7028 27.3078L14.6835 27.3079C9.87997 27.3013 5.64897 24.8363 3.1703 21.0896C2.64138 20.2901 1.56771 20.0729 0.772204 20.6045C-0.0233042 21.136 -0.239414 22.2151 0.28951 23.0146C3.08513 27.2405 7.6773 30.1703 12.9731 30.6989V32.5231H7.78392C6.82863 32.5231 6.0542 33.3015 6.0542 34.2616C6.0542 35.2217 6.82863 36 7.78392 36H21.6217C22.577 36 23.3514 35.2217 23.3514 34.2616C23.3514 33.3015 22.577 32.5231 21.6217 32.5231H16.4325V30.699C25.1734 29.8268 32 22.4148 32 13.4004C32 8.25161 29.7706 3.62379 26.2347 0.443083ZM14.7028 1.23127C8.01572 1.23127 2.59477 6.67954 2.59477 13.4003C2.59477 20.1211 8.01572 25.5694 14.7028 25.5694C21.3899 25.5694 26.8108 20.1211 26.8108 13.4003C26.8108 6.67954 21.3899 1.23127 14.7028 1.23127Z"
                      fill="#E7BA45"/>
            </svg>,
            title: "زبان",
            description:
                "مجموعه ای کامل از محتوا و سرویس های جامع و کاربردی جهت ارتقای مهارت زبان انگلیسی",
            Link: "/services/زبان",
        },
    ];

    return (
        <div className={`grid grid-cols-2 md:flex items-center justify-center gap-4  -mt-[30px] md:px-16`}>
            {cardsData.map((card, index) => (
                <Link
                    href={`${card.Link}`}
                    key={index}
                    className={` md:w-[17vw] flex flex-col items-center p-4 bg-white shadow-xl z-10`}
                >
                    <div
                        className=" w-10 h-10 md:w-20 md:h-20  rounded-full flex items-center justify-center text-4xl">
                        {card.icon}
                    </div>
                    <span className="mt-4 font-semibold text-[#494949] line-clamp-1">{card.title}</span>
                    <p className="text-center text-sm mt-2 h-[60px] line-clamp-3">
                        {card.description}
                    </p>
                </Link>
            ))}
        </div>

    /*<div className={'grid grid-cols-4 gap-6 -mt-[30px] px-16'}>
        {cardsData.map((card, i) => (
            <Link key={i}
                  href={`${card.Link}`}
                  className={'px-9 py-6 bg-white z-10 flex flex-col gap-y-3 items-center justify-center shadow text-center'}>
                <div className={'w-20 h-20 bg-primary/10 flex items-center justify-center rounded-full '}>
                    {card.icon}
                </div>
                <span>{card.description}</span>
            </Link>
        ))}
    </div>*/
)
    ;
};

export default PageCard;