import React from 'react';
import BreadCrumbs from "@/components/ui/breadCrumbs";
import ProfileSectionTitle from '@/components/pages/profile/ProfileSectionTitle';
import BackgroundImage from "@/components/pages/profile/common/BackgroundImage";
import {Button} from "@/components/ui/button";

const Page = () => {
    const BtnCard = ({icon, title}:any) => (
        <div
            className={'flex-grow bg-white shadow-[0_5px_14px_-9px_rgba(0,0,0,0.25)] h-[72px] rounded-[4px] flex items-center justify-center gap-x-3'}>
            <span>{icon}</span>
            <span>{title}</span>
        </div>
    )
    return (
        <>
            <BreadCrumbs
                links={[
                { name: "پروفایل", link: "/profile" },
                { name: "لینک های ورود", link: "/profile" },
                { name: "محصولات و خدمات", link: "/profile/Links/service" },
                ]}
            />
            <ProfileSectionTitle title={"محصولات و خدمات"} BackBtn/>
            <div className={'flex flex-col gap-y-6 px-6 lg:px-0 leading-[32px]'}>
                <BackgroundImage
                    imgSize={{width: 183, height: 190}}
                    img={'/images/pages/profile/temp/link_service_temp.png'}
                    icon={<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 256 256">
                        <g fill="currentColor">
                            <path d="M216 96v96a8 8 0 0 1-8 8H48a8 8 0 0 1-8-8V96Z" opacity="0.2"/>
                            <path
                                d="M224 48H32a16 16 0 0 0-16 16v24a16 16 0 0 0 16 16v88a16 16 0 0 0 16 16h160a16 16 0 0 0 16-16v-88a16 16 0 0 0 16-16V64a16 16 0 0 0-16-16m-16 144H48v-88h160Zm16-104H32V64h192zM96 136a8 8 0 0 1 8-8h48a8 8 0 0 1 0 16h-48a8 8 0 0 1-8-8"/>
                        </g>
                    </svg>
                    }
                    title={'محصولات و خدمات'}
                    desc={
                        <div className={'flex flex-col md:flex-row items-center gap-6'}>
                            {[{name: 'دوره ی دانشگاهی'}, {name: 'دوره ی BA'}].map((item, i) => (
                                <Button
                                    key={i}
                                    variant="outline"
                                    className={'w-[240px] h-[55px] '}>
                                    {item.name}
                                </Button>
                            ))}
                        </div>
                    }
                />

                <div className={'flex flex-col md:flex-row items-start gap-6'}>
                    <span>دانشگاهی</span>
                    <div className={'flex flex-col gap-y-1 border-r-2 border-r-primary pr-3'}>
                        <span>ما در همراهان با تمرکز بر ارائه بهترین روش ممکن برای ارتقای مدارک دانشگاهی متقاضیان با آسان‌ترین و کوتاه‌ترین </span>
                        <span>روش‌های ممکن به‌صورت قانونی و موردتأیید وزارت علوم در خدمت متقاضیان عزیز هستیم. </span>
                        <span>مزایای تجربه تحصیلات دانشگاهی با همراهان:</span>
                        <ul className={''}>
                            <li><span className={'font-digit ml-1'}>1.</span> ثبت نام بدون آزمون ورودی (کنکور)</li>
                            <li><span className={'font-digit ml-1'}>2.</span>عدم نیاز به شرکت در کلاس‌ها از طریق
                                برگزاری کلاس‌ها و آزمون‌ها به‌صورت آنلاین
                            </li>
                            <li><span className={'font-digit ml-1'}>3.</span>ارائه پشتیبانی علمی و آموزشی در حین
                                تحصیل
                            </li>
                            <li><span className={'font-digit ml-1'}>4.</span> امکان دریافت بیشترین واحد مجاز ترم در
                                هر مقطع تحصیلی
                            </li>
                            <li><span className={'font-digit ml-1'}>5.</span> عدم نیاز به اخذ ترم پیش‌نیاز در
                                ابتدای تحصیل
                            </li>
                        </ul>
                    </div>
                </div>
                <div className={'flex flex-wrap gap-6'}>
                    <BtnCard icon={<svg width="35" height="35" viewBox="0 0 35 35" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                        <circle cx="17.5" cy="17.5" r="17.5" fill="#EBF4F9"/>
                        <path
                            d="M15.05 4.53001L9.03002 8.46001C7.10002 9.72001 7.10002 12.54 9.03002 13.8L15.05 17.73C16.13 18.44 17.91 18.44 18.99 17.73L24.98 13.8C26.9 12.54 26.9 9.73001 24.98 8.47001L18.99 4.54001C17.91 3.82001 16.13 3.82001 15.05 4.53001Z"
                            stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                        <path
                            d="M10.6301 15.08L10.6201 19.77C10.6201 21.04 11.6001 22.4 12.8001 22.8L15.9901 23.86C16.5401 24.04 17.4501 24.04 18.0101 23.86L21.2001 22.8C22.4001 22.4 23.3801 21.04 23.3801 19.77V15.13"
                            stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                        <path d="M26.3999 17V11" stroke="white" strokeWidth="1.5" strokeLinecap="round"
                              strokeLinejoin="round"/>
                        <path
                            d="M16.5585 20.4C16.1505 20.88 15.5745 21.12 14.8305 21.12C14.1505 21.12 13.5785 20.908 13.1145 20.484L13.0305 21H11.9025V13.32H13.2225V15.9C13.6465 15.62 14.1705 15.48 14.7945 15.48C15.5865 15.48 16.1825 15.708 16.5825 16.164C16.9825 16.612 17.1825 17.308 17.1825 18.252C17.1825 19.204 16.9745 19.92 16.5585 20.4ZM13.2225 19.536C13.5665 19.88 13.9785 20.052 14.4585 20.052C14.9385 20.052 15.2905 19.908 15.5145 19.62C15.7385 19.324 15.8505 18.876 15.8505 18.276C15.8505 17.66 15.7345 17.22 15.5025 16.956C15.2785 16.684 14.9265 16.548 14.4465 16.548C13.9665 16.548 13.5585 16.692 13.2225 16.98V19.536ZM22.0042 20.424C21.5642 20.888 20.9242 21.12 20.0842 21.12C19.5482 21.12 19.1122 20.988 18.7762 20.724C18.4402 20.452 18.2722 20.04 18.2722 19.488C18.2722 18.36 18.9482 17.796 20.3002 17.796H21.9682V17.4C21.9682 17.032 21.8642 16.768 21.6562 16.608C21.4562 16.448 21.0962 16.368 20.5762 16.368C20.0082 16.368 19.4442 16.464 18.8842 16.656V15.816C19.1482 15.704 19.4522 15.62 19.7962 15.564C20.1482 15.508 20.5042 15.48 20.8642 15.48C21.6322 15.48 22.2162 15.648 22.6162 15.984C23.0162 16.32 23.2162 16.844 23.2162 17.556V21H22.0882L22.0042 20.424ZM19.4962 19.44C19.4962 19.992 19.8482 20.268 20.5522 20.268C20.8562 20.268 21.1202 20.22 21.3442 20.124C21.5682 20.028 21.7762 19.876 21.9682 19.668V18.588H20.6002C20.2482 18.588 19.9762 18.652 19.7842 18.78C19.5922 18.908 19.4962 19.128 19.4962 19.44Z"
                            fill="#049FF6"/>
                    </svg>
                    }
                             title={'کارشناسی'}
                    />
                    <BtnCard
                        icon={<svg width="35" height="35" viewBox="0 0 35 35" fill="none"
                                   xmlns="http://www.w3.org/2000/svg">
                            <circle cx="17.5" cy="17.5" r="17.5" fill="#E7F9EB"/>
                            <path
                                d="M15.05 6.53001L9.03002 10.46C7.10002 11.72 7.10002 14.54 9.03002 15.8L15.05 19.73C16.13 20.44 17.91 20.44 18.99 19.73L24.98 15.8C26.9 14.54 26.9 11.73 24.98 10.47L18.99 6.54001C17.91 5.82001 16.13 5.82001 15.05 6.53001Z"
                                stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path
                                d="M10.6301 17.08L10.6201 21.77C10.6201 23.04 11.6001 24.4 12.8001 24.8L15.9901 25.86C16.5401 26.04 17.4501 26.04 18.0101 25.86L21.2001 24.8C22.4001 24.4 23.3801 23.04 23.3801 21.77V17.13"
                                stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path d="M26.3999 19V13" stroke="white" strokeWidth="1.5" strokeLinecap="round"
                                  strokeLinejoin="round"/>
                            <path
                                d="M11.868 16.728C11.644 16.832 11.448 16.968 11.28 17.136V21H10.008V15.6H11.196L11.256 16.128C11.816 15.696 12.42 15.48 13.068 15.48C13.42 15.48 13.7 15.536 13.908 15.648C14.116 15.76 14.276 15.932 14.388 16.164C14.652 15.948 14.936 15.78 15.24 15.66C15.552 15.54 15.908 15.48 16.308 15.48C16.908 15.48 17.348 15.64 17.628 15.96C17.908 16.272 18.048 16.764 18.048 17.436V21H16.764V17.592C16.764 17.216 16.684 16.952 16.524 16.8C16.372 16.648 16.12 16.572 15.768 16.572C15.544 16.572 15.328 16.616 15.12 16.704C14.912 16.784 14.732 16.904 14.58 17.064C14.612 17.192 14.628 17.384 14.628 17.64V21H13.404V17.592C13.404 17.216 13.34 16.952 13.212 16.8C13.084 16.648 12.86 16.572 12.54 16.572C12.316 16.572 12.092 16.624 11.868 16.728ZM23.0042 20.424C22.5642 20.888 21.9242 21.12 21.0842 21.12C20.5482 21.12 20.1122 20.988 19.7762 20.724C19.4402 20.452 19.2722 20.04 19.2722 19.488C19.2722 18.36 19.9482 17.796 21.3002 17.796H22.9682V17.4C22.9682 17.032 22.8642 16.768 22.6562 16.608C22.4562 16.448 22.0962 16.368 21.5762 16.368C21.0082 16.368 20.4442 16.464 19.8842 16.656V15.816C20.1482 15.704 20.4522 15.62 20.7962 15.564C21.1482 15.508 21.5042 15.48 21.8642 15.48C22.6322 15.48 23.2162 15.648 23.6162 15.984C24.0162 16.32 24.2162 16.844 24.2162 17.556V21H23.0882L23.0042 20.424ZM20.4962 19.44C20.4962 19.992 20.8482 20.268 21.5522 20.268C21.8562 20.268 22.1202 20.22 22.3442 20.124C22.5682 20.028 22.7762 19.876 22.9682 19.668V18.588H21.6002C21.2482 18.588 20.9762 18.652 20.7842 18.78C20.5922 18.908 20.4962 19.128 20.4962 19.44Z"
                                fill="#45EB6A"/>
                        </svg>
                        }
                        title={'کارشناسی ارشد'}
                    />
                    <BtnCard
                        icon={<svg width="35" height="35" viewBox="0 0 35 35" fill="none"
                                   xmlns="http://www.w3.org/2000/svg">
                            <circle cx="17.5" cy="17.5" r="17.5" fill="#FFF3E9"/>
                            <path
                                d="M15.05 6.53001L9.03002 10.46C7.10002 11.72 7.10002 14.54 9.03002 15.8L15.05 19.73C16.13 20.44 17.91 20.44 18.99 19.73L24.98 15.8C26.9 14.54 26.9 11.73 24.98 10.47L18.99 6.54001C17.91 5.82001 16.13 5.82001 15.05 6.53001Z"
                                stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path
                                d="M10.6301 17.08L10.6201 21.77C10.6201 23.04 11.6001 24.4 12.8001 24.8L15.9901 25.86C16.5401 26.04 17.4501 26.04 18.0101 25.86L21.2001 24.8C22.4001 24.4 23.3801 23.04 23.3801 21.77V17.13"
                                stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path d="M26.3999 19V13" stroke="white" strokeWidth="1.5" strokeLinecap="round"
                                  strokeLinejoin="round"/>
                            <path
                                d="M15.8029 20.964C15.5309 21.068 15.2109 21.12 14.8429 21.12C14.1229 21.12 13.5509 20.904 13.1269 20.472C12.7029 20.032 12.4909 19.344 12.4909 18.408C12.4909 17.488 12.6989 16.772 13.1149 16.26C13.5389 15.74 14.1469 15.48 14.9389 15.48C15.2429 15.48 15.5149 15.516 15.7549 15.588C16.0029 15.652 16.2389 15.756 16.4629 15.9V13.32H17.7709V21H16.6429L16.5709 20.484C16.3309 20.7 16.0749 20.86 15.8029 20.964ZM14.1829 19.656C14.4149 19.92 14.7629 20.052 15.2269 20.052C15.7069 20.052 16.1189 19.88 16.4629 19.536V16.98C16.3029 16.836 16.1269 16.728 15.9349 16.656C15.7509 16.584 15.5389 16.548 15.2989 16.548C14.3229 16.548 13.8349 17.164 13.8349 18.396C13.8349 18.964 13.9509 19.384 14.1829 19.656ZM21.6175 16.824C21.2655 16.936 20.9815 17.06 20.7655 17.196V21H19.4455V15.6H20.7055L20.7655 16.164C21.0135 16.004 21.3055 15.86 21.6415 15.732C21.9775 15.604 22.3015 15.52 22.6135 15.48V16.572C22.3095 16.62 21.9775 16.704 21.6175 16.824Z"
                                fill="#F29242"/>
                        </svg>}
                        title={'دکتری'}
                    />
                    <BtnCard
                        icon={<svg width="35" height="35" viewBox="0 0 35 35" fill="none"
                                   xmlns="http://www.w3.org/2000/svg">
                            <circle cx="17.5" cy="17.5" r="17.5" fill="#FDEAEE"/>
                            <path
                                d="M15.05 5.53001L9.03002 9.46001C7.10002 10.72 7.10002 13.54 9.03002 14.8L15.05 18.73C16.13 19.44 17.91 19.44 18.99 18.73L24.98 14.8C26.9 13.54 26.9 10.73 24.98 9.47001L18.99 5.54001C17.91 4.82001 16.13 4.82001 15.05 5.53001Z"
                                stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path
                                d="M10.6301 16.08L10.6201 20.77C10.6201 22.04 11.6001 23.4 12.8001 23.8L15.9901 24.86C16.5401 25.04 17.4501 25.04 18.0101 24.86L21.2001 23.8C22.4001 23.4 23.3801 22.04 23.3801 20.77V16.13"
                                stroke="white" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path d="M26.3999 18V12" stroke="white" strokeWidth="1.5" strokeLinecap="round"
                                  strokeLinejoin="round"/>
                            <path
                                d="M15.5143 15.6L13.4863 21H12.0583L10.0183 15.6H11.3983L12.7663 19.56L14.1343 15.6H15.5143ZM18.4472 13.416V14.556H17.0072V13.416H18.4472ZM18.4472 15.6V21H17.1272V16.668H16.3472L16.4312 15.6H18.4472ZM22.9574 21.12C22.3894 21.12 21.8814 20.976 21.4334 20.688V23.376H20.1134V15.6H21.2414L21.3254 16.116C21.5494 15.9 21.7974 15.74 22.0694 15.636C22.3494 15.532 22.6734 15.48 23.0414 15.48C24.6094 15.48 25.3934 16.4 25.3934 18.24C25.3934 19.152 25.1894 19.86 24.7814 20.364C24.3734 20.868 23.7654 21.12 22.9574 21.12ZM21.9734 19.944C22.1574 20.016 22.3734 20.052 22.6214 20.052C23.5814 20.052 24.0614 19.456 24.0614 18.264C24.0614 17.664 23.9494 17.228 23.7254 16.956C23.5094 16.684 23.1574 16.548 22.6694 16.548C22.1734 16.548 21.7614 16.716 21.4334 17.052V19.62C21.6174 19.764 21.7974 19.872 21.9734 19.944Z"
                                fill="#FD325C"/>
                        </svg>
                        }
                        title={'ارشد و دکتری ویژه'}
                    />

                </div>
            </div>
        </>
    );
};

export default Page;